EVENTS = [
[
  "Родился Тихо Браге",
  "14.12.1546",
  "со дня рождения датского астронома Тихо Браге, известного своими исключительно точными наблюдениями. Тихо Браге умер 24 октября 1601 года в возрасте 54 лет. До первой демонстрации телескопа Галилеем оставалось 8 лет.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Tycho_Brahe.JPG/324px-Tycho_Brahe.JPG"
  ],
  [],
  ["birthday", "astro", "XVII"
  ]
],
[
  "Начало создания обсерватории Маунт-Вилсон",
  "20.12.1904",
  'назад Джордж Эллери Хейл получил одобрение на создание солнечной обсерватории Маунт-Вилсон (Mt. Wilson Solar Observatory). Слово "солнечная" в названии было убрано после завершения строительства 100-дюймового телескопа в 1917 году.',
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/PSM_V74_D518_Steel_building_and_60_inch_reflector.png/640px-PSM_V74_D518_Steel_building_and_60_inch_reflector.png"
  ],
  [],
  ["astro", "telescope", "observatory", "solar observatory", "Mt. Wilson"
  ]
],
[
  "Открытие спутника Янус",
  "15.12.1966",
  "назад французским астрономом Одуэном Дольфюсом открыт спутник Сатурна Янус, находящийся на коорбитальной орбите с другим спутником Сатурна, Эпиметеем. Из-за этого спутники некоторое время путали.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/PIA12714_Janus_crop.jpg/577px-PIA12714_Janus_crop.jpg"
  ],
  [],
  ["astro", "discovery", "solar system", "satellite"
  ]
],
[
  "Родился Г.Н. Дубошин",
  "25.12.1904",
  "назад родился советский астроном Георгий Николаевич Дубошин. Он является одним из создателей московской школы небесной механики, автор ряда фундаментальных учебников по небесной механике, вёл исследования в области астродинамики, теоретической механики, теории устойчивости, теории притяжения.",
  ["https://upload.wikimedia.org/wikipedia/ru/1/12/%D0%94%D1%83%D0%B1%D0%BE%D1%88%D0%B8%D0%BD_%D0%93%D0%B5%D0%BE%D1%80%D0%B3%D0%B8%D0%B9_%D0%9D%D0%B8%D0%BA%D0%BE%D0%BB%D0%B0%D0%B5%D0%B2%D0%B8%D1%87.jpg"
  ],
  [],
  ["birthday", "astro"
  ]
],
[
  "Родился И. Кеплер",
  "27.12.1571",
  "со дня рождения немецкого математика, астронома, механика, оптика, первооткрывателя законов движения планет Солнечной системы Иоганна Кеплера.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Johannes_Kepler_1610.jpg/437px-Johannes_Kepler_1610.jpg"
  ],
  [],
  ["birthday", "astro"
  ]
],
[
  "Родился Дж. У. Ричи",
  "31.12.1864",
  "со дня рождения американский астронома и конструктора телескопов Джорджа Уиллиса Ричи. Совершенствовал астрономические инструменты и методы наблюдений, соавтор распространенной современной системы рефлектора Ричи – Кретьена.",
  [],
  ["31.12.(2).jpg"
  ],
  ["birthday", "astro"
  ]
],
[
  "Родился Р.Г. Эйткен",
  "31.12.1864",
  "со дня рождения американского астронома Роберта Гранта Эйткена. Эйткен открыл более 3000 двойных звезд.",
  ["https://upload.wikimedia.org/wikipedia/commons/7/7c/Robertgrantaitken.jpg"
  ],
  [],
  ["birthday", "astro"
  ]
],
[
  "первый свет на 5-метровом телескопе Хейла",
  "26.01.1949",
  "назад был получен первый свет на 5.1-метровом телескопе имени Джорджа Хейла. До введения в строй Большого Телескопа Азимутального на Северном Кавказе в 1975 году он оставался крупнейшим в мире.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/P200_Dome_Open.jpg/1024px-P200_Dome_Open.jpg"
  ],
  [],
  ["first light", "astro", "telescope"
  ]
],
[
  "первый свет на Большом Канарском телескопе",
  "13.07.2007",
  "назад получен первый свет на Большом Канарском телескопе &ndash; The Gran Telescopio Canarias. С момента постройки GTC является крупнейшим телескопом в мире, но уступает по площади зеркал комплексу Большого бинокулярного телескопа.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Grantelescopio.jpg/640px-Grantelescopio.jpg"
  ],
  [],
  ["first light", "astro", "telescope"
  ]
],
[
  "Запуск ПС-1",
  "04.10.1957",
  "назад был запущен первый искусственный спутник Земли.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Sputnik_asm.jpg/586px-Sputnik_asm.jpg"
  ],
  [],
  ["космонавтика", "satellite"
  ]
],
[
  "Маринер-2 стал первой межпланетной миссией",
  "14.12.1962",
  "назад аппарат NASA Маринер-2 стал первой межпланетной миссией, пролетев  на расстоянии 34833 км от поверхности Венеры.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Mariner_2.jpg/598px-Mariner_2.jpg"
  ],
  [],
  ["космонавтика", "satellite"
  ]
],
[
  "Старт КА «Вега-1» и «Вега-2»",
  "15.12.1984",
  "назад, 15 и 21 декабря, с помощью ракеты «Протон» стартовали «Вега-1» и «Вега-2». Эти советские автоматические межпланетные станции предназначались для изучения Венеры и кометы Галлея.",
  [],
  ["15.12.(2).jpg"
  ],
  ["космонавтика", "satellite"
  ]
],
[
  "На орбиту выведена АМС «Пионер-6»",
  "16.12.1965",
  "назад на гелиоцентрическую орбиту выведена автоматическая межпланетная станция «Пионер-6». Целью аппаратов «Пионер» было изучение солнечной плазмы, микрометеоритных потоков, космических лучей, магнитных возмущений, солнечного ветра, физики частиц.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Pioneer-6-9.jpg/487px-Pioneer-6-9.jpg"
  ],
  [],
  ["космонавтика", "satellite"
  ]
],
[
  "Аполлон-8 вышел на окололунную орбиту",
  "24.12.1968",
  "назад состоялась миссия «Аполлон-8». Земляне впервые облетели Луну. Была получена знаменитая фотография восхода Земли над лунным горизонтом. Корабль вышел на окололунную орбиту 24 декабря и оставался на ней в течение 20 часов, сделав 10 витков вокруг Луны.",
  [],
  ["24.12..jpg"
  ],
  ["космонавтика", "human spaceflight", "spaceflight", "spacecraft", "moon", "Apollo"
  ]
],
[
  "Запущена космическая станция Салют-4",
  "26.12.1974",
  "назад была запущена космическая станция «Салют-4».",
  [],
  ["26.12.(4).jpg"
  ],
  ["космонавтика", "spacecraft", "space station"
  ]
],
[
  "стартовала последняя миссия к Луне Аполлон 17",
  "07.12.1972",
  "назад стартовала последняя миссия к Луне Аполлон 17. С борта космического корабля была сделана знаменитая фотография Земли из космоса.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/The_Earth_seen_from_Apollo_17.jpg/480px-The_Earth_seen_from_Apollo_17.jpg"
  ],
  [],
  ["космонавтика", "human spaceflight", "spaceflight", "spacecraft", "moon", "Apollo"
  ]
],
[
  "Последняя высадка людей на Луну",
  "11.12.1972",
  "назад в ходе миссии Аполлон-17 произошла шестая и последняя высадка человека на Луну. Астронавты оставались на Луне чуть более трёх суток. За это время они совершили три выхода из корабля общей продолжительностью 22 часа. Было собрано и привезено на Землю 110.5 кг образцов лунной породы.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/NASA_Apollo_17_Lunar_Roving_Vehicle.jpg/480px-NASA_Apollo_17_Lunar_Roving_Vehicle.jpg"
  ],
  [],
  ["космонавтика", "human spaceflight", "spaceflight", "spacecraft", "moon", "Apollo"
  ]
],
[
  "Последние люди на Луне",
  "14.12.1972",
  "назад Харрисон Шмитт и Юджин Сернан покинули поверхность Луны в ходе последней пилотируемой миссии Аполлон-17. Юджин Сернан стал последним человеком, стоявшим на поверхности Луны.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Apollo_17_Cernan_on_moon.jpg/465px-Apollo_17_Cernan_on_moon.jpg"
  ],
  [],
  ["космонавтика", "human spaceflight", "spaceflight", "spacecraft", "moon", "Apollo"
  ]
],
[
  "Венера-12 совершила мягкую посадку на поверхность Венеры",
  "25.12.1978",
  "назад космический аппарат «Венера 12» совершил мягкую посадку на поверхность Венеры.",
  [],
  ["25.12.(2).jpg"
  ],
  ["космонавтика", "spaceflight", "spacecraft", "landing", "Венера", "Venus"
  ]
],
[
  "Запущен пилотируемый космический корабль «Союз Т-10»",
  "08.02.1984",
  "назад был запущен пилотируемый космический корабль «Союз Т-10». 9 февраля произошла стыковка с орбитальной научной станцией «Салют-7», которая с ноября 1983 года была необитаемой и находилась в автоматическом режиме полёта.",
  ["https://upload.wikimedia.org/wikipedia/en/8/82/Salyut7.jpg"],
  [],
  ["космонавтика", "spaceflight", "spacecraft", "landing", "Венера", "Venus"
  ]
],
[
  "КА Галилео достиг Юпитера",
  "07.12.1995",
  "назад космический аппарат Галилео достиг Юпитера.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Artwork_Galileo-Io-Jupiter.JPG/597px-Artwork_Galileo-Io-Jupiter.JPG"
  ],
  [],
  ["космонавтика", "spaceflight", "spacecraft"
  ]
],
[
  "Запуск шаттла Индевор в рамках миссии STS-99",
  "11.02.2000",
  "назад в рамках миссии STS-99 c мыса Канаверал стартовал шаттл Индевор. Главная цель &ndash; создание цифровой модели высот Земли с помощью радарной топографической съёмки. Полученная цифровая модель охватила 80% земной суши (от 56° ю. ш. до 60° с. ш.) и являлась наиболее полной до 2009 года. Общая проолжительность миссии &ndash 11 дней 5 часов 39 минут.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Space_Shuttle_Endeavour_launches_on_STS-99.jpg/606px-Space_Shuttle_Endeavour_launches_on_STS-99.jpg"
  ],
  [],
  ["космонавтика", "launch", "launch vehicle", "human spaceflight", "spaceflight", "space shuttle",
  ]
],
[
  "Запуск шаттла Индевор в рамках миссии STS-130",
  "08.02.2010",
  "назад в миссии STS-130 c мыса Канаверал стартовал шаттл Индевор. Основная цель &ndash; доставка и установка модулей «Транквилити» («Спокойствие») и «Купол». Миссия завершилась успешной посадкой 22.02.2010. Общая проолжительность миссии &ndash 13 дней 18 часов 6 минут.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/STS-130_launching_1.jpg/504px-STS-130_launching_1.jpg"
  ],
  [],
  ["космонавтика", "launch", "launch vehicle", "human spaceflight", "spaceflight", "space shuttle", "ISS", "МКС"
  ]
],
[
  "первый запуск ракеты-носителя Falcon 9",
  "04.06.2010",
  "назад состоялся первый запуск ракеты-носителя Falcon 9 среднего класса компании США SpaceX. По своим характеристикам ракета схожа с советским, а затем российским носителем Протон-К.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Falcon_9_launch.jpg/319px-Falcon_9_launch.jpg"
  ],
  [],
  ["космонавтика", "launch", "launch vehicle", "falcon 9", "spacex"
  ]
],
[
  "запущен китайский метеорологический спутник Фэнъюнь-2G",
  "31.12.2014",
  "назад был запущен китайский метеорологический спутник Фэнъюнь-2G. Китайская космонавтика работает без выходных!",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/20090829_Model_of_Fengyun-2_4002.JPG/399px-20090829_Model_of_Fengyun-2_4002.JPG"
  ],
  [],
  ["космонавтика", "launch", "Fengyun"
  ]
],
[
  "произведена вертикальная посадка первой ступени ракеты-носителя Falcon 9",
  "22.12.2015",
  "назад, 21 декабря около 17-40 по местному времени, была произведена вертикальная посадка первой ступени ракеты-носителя Falcon 9. В августе 2016 ступень была установлена на территории штаб-квартиры SpaceX в Хоторне, штат Калифорния.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/ORBCOMM-2_%2823282658734%29.jpg/512px-ORBCOMM-2_%2823282658734%29.jpg"
  ],
  [],
  ["космонавтика", "launch", "launch vehicle", "falcon 9", "spacex"
  ]
],
[
  "международный день гражданской авиации",
  "07.12.1944",
  "назад была подписана конвенция о международной гражданской авиации. С 1994 года седьмого декабря отмечается международный день гражданской авиации.",
  ["https://upload.wikimedia.org/wikipedia/ru/6/62/International_Civil_Aviation_Organization_logo.svg"
  ],
  [],
  ["aviation"
  ]
],
[
  "рекорд высотного прыжка и пилотируемого полета на стратостате",
  "14.10.2012",
  "назад Феликсом Баумгартнером был поставлен рекорд по высоте прыжка с парашютом (38 969.3 метра), и по скорости свободного падения (1 357.64 км/ч). Таким образом, парашютист стал первым человеком, преодолевшим в прыжке звуковой барьер.",
  ["https://upload.wikimedia.org/wikipedia/en/a/a2/Baumgartner_RBSjump.jpg"
  ],
  [],
  ["parachuting", "stratospheric jump", "stratosphere baloon"
  ]
],
[
  "родился Эдсгер Вибе Дейкстра",
  "11.05.1930",
  'назад родился Эдсгер Вибе Дейкстра – нидерландский ученый, труды которого  оказали влияние на развитие информатики и информационных технологий; один из разработчиков концепции структурного программирования. Автор статьи "о вреде оператора GoTo", опубликованной в марте 1968 года.',
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Edsger_Wybe_Dijkstra.jpg/360px-Edsger_Wybe_Dijkstra.jpg"
  ],
  [],
  ["birthday", "programming", "программирование"
  ]
],
[
  "родился Айвен Сазерленд",
  "16.05.1938",
  "назад родился Айвен Сазерленд – американский ученый в области информатики и пионер интернета, известный как «отец компьютерной графики». Получил премию Тьюринга в 1988 году за создание «Sketchpad», прообраз современного графического интерфейса систем автоматизированного проектирования.",
  ["https://upload.wikimedia.org/wikipedia/commons/5/5c/Ivan_Sutherland_at_CHM.jpg"
  ],
  [],
  ["birthday", "programming", "программирование"
  ]
],
[
  "найден первый в истории баг",
  "09.09.1947",
  "назад операторами электромеханического компьютера Harvard Mark II был найден первый в истории баг – моль в реле. В это время с компьютером работала пионер в программировании Грейс Хоппер.",
  ["https://upload.wikimedia.org/wikipedia/commons/8/8a/H96566k.jpg"
  ],
  [],
  ["history", "programming", "программирование"
  ]
],
[
  "Родился Стив Джобс",
  "24.02.1955",
  "назад родился Стивен Пол (Стив) Джобс, предприниматель, промышленный дизайнер и сооснователь корпорации Apple.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Steve_Jobs_Headshot_2010-CROP2.jpg/375px-Steve_Jobs_Headshot_2010-CROP2.jpg"
  ],
  [],
  ["birthday", "it", "design"
  ]
],
[
  "Родился Андерс Хейлсберг",
  "02.12.1960",
  "назад родился Андерс Хейлсберг, датский инженер-программист, создатель Turbo Pascal и главный архитектор Delphi, ключевой разработчик C# и TypeScript.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Anders_Hejlsberg.jpg/440px-Anders_Hejlsberg.jpg"
  ],
  [],
  ["birthday", "programming", "программирование"
  ]
],
[
  "Основана Apple Computer Company",
  "01.04.1976",
  "назад Стивом Джобсом, Стивом Возняком и Рональдом Уэйном была основана Apple Computer Company.",
  [],
  ["Jobs-Wozniak_photo_20100127.jpg"
  ],
  ["it", "history"
  ]
],
[
  "сделана фотография команды Microsoft",
  "07.12.1978",
  "назад была сделана фотография команды Microsoft. Найдите Билла Гейтса!",
  ["https://russianpulse.ru/img/http://ic.pics.livejournal.com/matveychev_oleg/27303223/4331761/4331761_original.jpg"
  ],
  [],
  ["it", "history"
  ]
],
[
  "в продажу поступил Apple Macintosh",
  "24.01.1984",
  "назад в продажу поступил компьютер Apple Macintosh.",
  ["https://upload.wikimedia.org/wikipedia/commons/e/e3/Macintosh_128k_transparency.png"
  ],
  [],
  ["it", "history", "design"
  ]
],
[
  "вышел Тетрис",
  "06.06.1984",
  'назад советским программистом Алексеем Пажитновым представлена игра "Тетрис". В это время Пажитнов работал в Вычислительном центре Академии наук СССР.',
  ["https://cs6.pikabu.ru/post_img/big/2014/06/06/11/1402078970_102983514.jpg"
  ],
  [],
  ["it", "history", "programming", "программирование", "games"
  ]
],
[
  "Вышла первая публичная версия ядра Linux",
  "17.09.1991",
  "назад вышла первая публичная версия ядра Linux: 0.01. Анонс был опубликован Линусом Торвальдсом 25 августа, именно эта дата считается рождением операционной системы.",
  ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Tux.svg/500px-Tux.svg.png"
  ],
  [],
  ["it", "history", "operation system", "design", "linux"
  ]
]
]